ror_api/app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    articles = Article.all()

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 12 LIMIT 1
---
  def show
    article = Article.find(params[:id])

INSERT INTO `articles` (`title`, `body`, `author`, `created_at`, `updated_at`) VALUES ('Hello Rails 3', 'I am on Rails 3!', 'author 3', '2024-11-25 08:12:10.846061', '2024-11-25 08:12:10.846061')
---
  def create
    article = Article.new(title: article_params[:title], body: article_params[:body], author: article_params[:author])

    if article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'Hello Rails 2 U', `articles`.`body` = 'I am on Rails 2 U!', `articles`.`author` = 'author 2 U', `articles`.`updated_at` = '2024-11-25 08:16:26.317447' WHERE `articles`.`id` = 2
---
  def update
    article = Article.find(params[:id])
    if article
      if article.update(article_params)
        article = Article.find(params[:id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 2
---
  def destroy
    article = Article.find(params[:id])
    if article
      article.destroy